rottenpotatoes/rails-intro/app/controllers/movies_controller.rb

  def index
    #check params
    boxes = params[:ratings]
    sort_by =params[:sort_by]
    if (!boxes || !sort_by) then
      boxes = session[:ratings] if  !boxes
      sort_by = session[:sort_by]  if  !sort_by
      flash.keep
      if (boxes && sort_by) then
        redirect_to(movies_path(sort_by: sort_by, ratings: boxes))
      end
    end

    @all_ratings = Movie.movie_ratings
    @selected_rating = Hash.new();

    if !boxes then
      # firs load - set all checkboxes to true
      @all_ratings.each  { |rating| @selected_rating[rating] =true }
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R') ORDER BY release_date